//
//  Track.swift
//  PizzaExpress
//
//  Created by N N on 03.09.2023.
//

struct Track {
    let pizza: String
    let sostav: String
    
    var title: String {
        "\(pizza)"
    }
    
    static func getTrackList() -> [Track] {
        [
            Track(pizza: "Маргарита", sostav:"сыр Моцарелла,томатный соус"),
            Track(pizza: "Пепперони", sostav: "Пепперони, сыр Моцарелла, томатный соус"),
            Track(pizza: "Карбонара", sostav: "бекон, сливочный соус, сыр моцарелла, сыр пармезан"),
            Track(pizza: "4 сыра", sostav: "соус Карбоната, сыр Чеддер, сыр Моцарелла, сыр Роккфорти"),
            Track(pizza: "Чикен Ранч", sostav: "грибы, курица, лук, сыр Моцарелла, соус Ранч"),
            Track(pizza: "Гавайская", sostav: "куриное филе маринованное, ветчина, ананас, сыр моцарелла"),
            Track(pizza: "Ветчина и грибы", sostav: "ветчина, шампиньоны, сыр пармезан, сыр моцарелла, соус сливочный"),
            Track(pizza: "Мясная острая", sostav: "свинина маринованная, колбаски охотничьи, помидоры, сыр моцарелла"),
            Track(pizza: "Барбекю BBQ", sostav: "куриное филе маринованное, ветчина, бекон, сыр моцарелла, перец болгарский"),
            Track(pizza: "Вегетарианская", sostav: "кабачки, помидоры, перец болгарский красный, лук красный, маслины"),
            Track(pizza: "Дольче Вита", sostav: "Творожный сыр, сгущенное молоко, ананас, яблоки, малина"),
        ]
    }
    
    
    
}

